{
    "id": "BTd5Tak69u",
    "signatures": [
        "ICLR.cc/2024/Conference/Submission7124/Authors"
    ],
    "readers": [
        "everyone"
    ],
    "writers": [
        "ICLR.cc/2024/Conference",
        "ICLR.cc/2024/Conference/Submission7124/Authors"
    ],
    "forum": "BTd5Tak69u",
    "content": {
        "title": {
            "value": "Unsupervised Learning of Object-Centric Representation from Multi-Viewpoint Scenes"
        },
        "authors": {
            "value": [
                "Tonglin Chen",
                "Yinxuan Huang",
                "Zhimeng Shen",
                "Jinghao Huang",
                "Lin Zhu",
                "Dakun Yang",
                "Bin Li",
                "Xiangyang Xue"
            ]
        },
        "authorids": {
            "value": [
                "~Tonglin_Chen1",
                "~Yinxuan_Huang1",
                "~Zhimeng_Shen2",
                "~Jinghao_Huang1",
                "~Lin_Zhu11",
                "~Dakun_Yang1",
                "~Bin_Li4",
                "~Xiangyang_Xue2"
            ]
        },
        "keywords": {
            "value": [
                "Object-Centric Learning",
                "Mulit-Viewpoints Learning"
            ]
        },
        "abstract": {
            "value": "Objects in a 2D image are influenced by factors like perspective, illumination, and occlusion in the corresponding 3D scene. This results in the challenge of identifying objects across different viewpoints. Humans can effortlessly identify objects from different viewpoints by recognizing their invariant characteristics in 3D dimensions. Motivated by this observation, we propose an object-centric learning method named Learning Object-centric Representation from Multi-viewpoint (LORM), which learns the representations of objects from multi-viewpoint scenes without any supervision. LORM leverages a novel slot attention encoder to decompose the representation of a scene into two distinct components: a viewpoint representation and several object representations. The former encompasses the viewpoint-dependent attributes (i.e., camera position and lighting) of the image observed from each viewpoint, while the latter captures the viewpoint-independent features (i.e., appearance, shape, scale, rotation and position) of the object across various perspectives. We propose a mixture patch decoder to enable LORM to simultaneously handle complex scenes and reconstruct an individual object's 2D appearance and shape at a specific viewpoint through the corresponding object representation and viewpoint representation. Extensive experiments are conducted on three complex simulation datasets, and the results demonstrate that our proposed method outperforms compared methods in individual object reconstruction while achieving comparable performance in scene decomposition."
        },
        "primary_area": {
            "value": "unsupervised, self-supervised, semi-supervised, and supervised representation learning"
        },
        "code_of_ethics": {
            "value": "I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics."
        },
        "submission_guidelines": {
            "value": "I certify that this submission complies with the submission instructions as described on https://iclr.cc/Conferences/2024/AuthorGuide."
        },
        "anonymous_url": {
            "value": "I certify that there is no URL (e.g., github page) that could be used to find authors' identity."
        },
        "no_acknowledgement_section": {
            "value": "I certify that there is no acknowledgement section in this submission for double blind review."
        },
        "venue": {
            "value": "ICLR 2024 Conference Withdrawn Submission"
        },
        "venueid": {
            "value": "ICLR.cc/2024/Conference/Withdrawn_Submission"
        },
        "pdf": {
            "value": "/pdf/2c15c2161edbf9a3d823b54eafa96393f856d6fa.pdf"
        },
        "supplementary_material": {
            "value": "/attachment/65b1c01b47c8a3004ec9b64cc8853e82ca0289a8.zip"
        },
        "_bibtex": {
            "value": "@misc{\nchen2024unsupervised,\ntitle={Unsupervised Learning of Object-Centric Representation from Multi-Viewpoint Scenes},\nauthor={Tonglin Chen and Yinxuan Huang and Zhimeng Shen and Jinghao Huang and Lin Zhu and Dakun Yang and Bin Li and Xiangyang Xue},\nyear={2024},\nurl={https://openreview.net/forum?id=BTd5Tak69u}\n}"
        },
        "paperhash": {
            "value": "chen|unsupervised_learning_of_objectcentric_representation_from_multiviewpoint_scenes"
        }
    },
    "number": 7124,
    "invitations": [
        "ICLR.cc/2024/Conference/-/Submission",
        "ICLR.cc/2024/Conference/-/Post_Submission",
        "ICLR.cc/2024/Conference/Submission7124/-/Revision",
        "ICLR.cc/2024/Conference/-/Withdrawn_Submission",
        "ICLR.cc/2024/Conference/-/Edit"
    ],
    "domain": "ICLR.cc/2024/Conference",
    "tcdate": 1695456441002,
    "cdate": 1695456441002,
    "tmdate": 1711385562274,
    "mdate": 1711385562274,
    "odate": 1697213872796,
    "version": 2
}